Tekla Open API Reference for Tekla Structures 2025
WpfMaterialCatalog Properties
The WpfMaterialCatalog type exposes the following members.
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedMaterial
 Gets the selected material in the control.
Top
See Also
Reference
WpfMaterialCatalog Class
Tekla.Structures.Dialog.UIControls Namespace